**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [96]:
import pandas as pd
import numpy as np
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

dframe = pd.DataFrame(data,labels)
dframe

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [97]:
dframe.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [98]:
df=dframe.head(2)
df

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [99]:
dframe['birds'], dframe['age']

(a        Cranes
 b        Cranes
 c       plovers
 d    spoonbills
 e    spoonbills
 f        Cranes
 g       plovers
 h        Cranes
 i    spoonbills
 j    spoonbills
 Name: birds, dtype: object, a    3.5
 b    4.0
 c    1.5
 d    NaN
 e    6.0
 f    3.0
 g    5.5
 h    NaN
 i    8.0
 j    4.0
 Name: age, dtype: float64)

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [100]:
print(dframe['birds'].iloc[2],dframe['age'].iloc[2],dframe['visits'].iloc[2])
print(dframe['birds'].iloc[3],dframe['age'].iloc[3],dframe['visits'].iloc[3])
print(dframe['birds'].iloc[7],dframe['age'].iloc[7],dframe['visits'].iloc[7])

plovers 1.5 3
spoonbills nan 4
Cranes nan 2

**6. select the rows where the number of visits is less than 4**

In [101]:
dframe[dframe['visits']<4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [102]:
dframe[dframe['age'].isnull()]

        birds  age  visits priority
d  spoonbills  NaN       4      yes
h      Cranes  NaN       2      yes

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [103]:
dframe[(dframe['birds']=='Cranes') & (dframe['age']<4)]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [104]:
dframe[(dframe['age']>=2) & (dframe['age']<=4)]

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [105]:
dframe[(dframe['birds']=='Cranes') & (dframe['visits']>0)].sum()

birds       CranesCranesCranesCranes
age                             10.5
visits                            12
priority                 yesyesnoyes
dtype: object

**11. Calculate the mean age for each different birds in dataframe.**

In [106]:
mean_age_of_cranes=dframe[(dframe['birds']=='Cranes') & (dframe['age'])].mean()
print(mean_age_of_cranes,'\n')

mean_age_of_spoonbills=dframe[(dframe['birds']=='spoonbills') & (dframe['age'])].mean()
print(mean_age_of_spoonbills,'\n')

mean_age_of_plovers=dframe[(dframe['birds']=='plovers') & (dframe['age'])].mean()
print(mean_age_of_plovers)

age       3.500000
visits    3.333333
dtype: float64

age       6.000000
visits    2.666667
dtype: float64

age       3.5
visits    2.5
dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [107]:
dframe1=dframe.copy()
df={'birds':'Cranes','age': 6,'visits':5,'priority':'yes'}
dframe1=dframe1.append(df,ignore_index=True)
dframe1.drop([10])

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [108]:
dframe.groupby(dframe['birds']).count()

            age  visits  priority
birds
Cranes        3       4         4
plovers       2       2         2
spoonbills    3       4         4

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [109]:
dframe_age= dframe.sort_values('age')
print(dframe_age,'\n')

dframe_visits= dframe.sort_values('visits',ascending=False)
print(dframe_visits)

        birds  age  visits priority
c     plovers  1.5       3       no
f      Cranes  3.0       4       no
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
j  spoonbills  4.0       2       no
g     plovers  5.5       2       no
e  spoonbills  6.0       3       no
i  spoonbills  8.0       3       no
d  spoonbills  NaN       4      yes
h      Cranes  NaN       2      yes

        birds  age  visits priority
b      Cranes  4.0       4      yes
d  spoonbills  NaN       4      yes
f      Cranes  3.0       4       no
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
i  spoonbills  8.0       3       no
a      Cranes  3.5       2      yes
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
j  spoonbills  4.0       2       no

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [110]:
dframe2=dframe.copy()
dframe2=dframe2.replace({'priority':{'yes' :'1','no' :'0'}})
dframe2

        birds  age  visits priority
a      Cranes  3.5       2        1
b      Cranes  4.0       4        1
c     plovers  1.5       3        0
d  spoonbills  NaN       4        1
e  spoonbills  6.0       3        0
f      Cranes  3.0       4        0
g     plovers  5.5       2        0
h      Cranes  NaN       2        1
i  spoonbills  8.0       3        0
j  spoonbills  4.0       2        0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [111]:
dframe=dframe.replace({'birds':{'Cranes':'trumpeters'}})
dframe['birds']
dframe

        birds  age  visits priority
a  trumpeters  3.5       2      yes
b  trumpeters  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f  trumpeters  3.0       4       no
g     plovers  5.5       2       no
h  trumpeters  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no